In [9]:
import pandas as pd
import numpy as np
import sqlite3
from sqlalchemy import create_engine

In [10]:
db_path = '../data/raw/machinehead20.db'

In [11]:
db_engine = create_engine(f'sqlite:///{db_path}')

In [12]:
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", db_engine)

            name
0      rank_info
1  personal_info
2  business_info

In [19]:
# You call this function when you want to see one of the tables as a Panda's dataframe
def table_to_df(table_name):
    df = pd.read_sql_query(f'SELECT * FROM {table_name}', db_engine)
    return df

# This function generally describes the dataframe
def describe_df(table_name):
    description = table_to_df(table_name).describe()
    return description

In [22]:
table_to_df('business_info')

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,8098,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,3112,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,7509,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,3270,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,6859,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5
...,...,...,...,...,...,...,...
2203,4528,2255,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,0.0 millions USD,None,2134
2204,8782,2256,Manufacturing ==> electrical equipment,1.0 BUSD,nan millions USD,None,2134
2205,6135,2257,Manufacturing ==> electrical equipment,1.0 BUSD,0.0 millions USD,None,1856
2206,3197,2258,Manufacturing ==> printed circuit boards,1.0 BUSD,0.0 millions USD,None,1978
2207,7080,2259,Diversified ==> diversified,1.0 BUSD,nan millions USD,None,1978

In [16]:
table_to_df('personal_info')

,id,lastName,age,Unnamed: 0,gender,country,image
0,8098,beZOs,54 years old,52,M,None,https://specials-images.forbesimg.com/imageser...
1,3112,gaTEs,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,7509,bufFETt,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,3270,arNAULt,69 years old,55,M,None,https://specials-images.forbesimg.com/imageser...
4,6859,zUCKERBERg,1985,56,M,United States,https://specials-images.forbesimg.com/imageser...
...,...,...,...,...,...,...,...
2203,4528,zHAO,51 years old,2255,M,China,https://specials-images.forbesimg.com/imageser...
2204,8782,zhOU,55 years old,2256,Male,None,https://specials-images.forbesimg.com/imageser...
2205,6135,ZHU,51 years old,2257,M,China,https://specials-images.forbesimg.com/imageser...
2206,3197,ZHUO,52 years old,2258,F,None,https://specials-images.forbesimg.com/imageser...
2207,7080,zORLu,54 years old,2259,Male,Turkey,https://specials-images.forbesimg.com/imageser...

In [21]:
table_to_df('rank_info')

        id                         name  position  Unnamed: 0
0     4233  ananT ASAVABHOKHIN & family       NaN           0
1     8800               arash fERdowsi       NaN           1
2     8531     banthoon LAMSAm & family       NaN           2
3     8646       bill adderlEY & FAMILy       NaN           3
4     5200            BORIS ZINGAREVICH       NaN           4
...    ...                          ...       ...         ...
2255  4528               zhao XIAOQIAng    2204.0        2255
2256  8782              ZHOU LIANgzhang    2205.0        2256
2257  6135                 zhu xINGMING    2206.0        2257
2258  3197                     ZHUO Jun    2207.0        2258
2259  7080                  oLGUN ZORLU    2208.0        2259

[2260 rows x 4 columns]

In [26]:
describe_df('business_info')

                id   Unnamed: 0  realTimePosition
count  2208.000000  2208.000000       2208.000000
mean   5538.967844  1155.500000       1102.043478
std    2615.127066   637.539018        630.218047
min    1008.000000    52.000000          1.000000
25%    3250.500000   603.750000        555.750000
50%    5647.000000  1155.500000       1106.500000
75%    7832.750000  1707.250000       1655.250000
max    9993.000000  2259.000000       2153.000000

In [27]:
describe_df('personal_info')

                id   Unnamed: 0
count  2208.000000  2208.000000
mean   5538.967844  1155.500000
std    2615.127066   637.539018
min    1008.000000    52.000000
25%    3250.500000   603.750000
50%    5647.000000  1155.500000
75%    7832.750000  1707.250000
max    9993.000000  2259.000000

In [28]:
describe_df('rank_info')

                id     position   Unnamed: 0
count  2260.000000  2208.000000  2260.000000
mean   5558.170354  1104.500000  1129.500000
std    2612.271048   637.539018   652.550126
min    1008.000000     1.000000     0.000000
25%    3280.750000   552.750000   564.750000
50%    5670.500000  1104.500000  1129.500000
75%    7840.250000  1656.250000  1694.250000
max    9993.000000  2208.000000  2259.000000